config :katex,
  max_karma: 10,
  default_name: "Юппи",
  text: %{
    start: """
    <i>У вас завелся котик. Сейчас он тихо сидит в уголке.
    Как его зовут?</i>
    """,
    name_cat: """
    <i>Котeйке нравится имя <%= cat.name %></i>
    """,
    noname_cat: """
    <i>Котик решил, что будет зваться <%= cat.name %></i>
    """,
    already_cat: "<i>У вас уже есть котик!</i>",
    away_pet: """
    <i><%= who.fname <> " " <> who.sname %> хочет погладить котяру, но обнаруживает, что того нет дома.</i>
    """,
    awake_pet: """
    <i><%= who.fname <> " " <> who.sname %> погладил котяру.</i>
    """,
    bad_pet: """
    <i><%= cat.name %> недоволен и цапает <%= who.fname <> " " <> who.sname %> за палец.</i>
    ШШШШ.
    """,
    joyful_pet: """
    <i><%= who.fname <> " " <> who.sname %> погладил котика</i>
    Мурррррррр.
    """,
    sad_pet: "Мямямяууууу...",
    sleep_pet: """
    <i><%= who.fname <> " " <> who.sname %> погладил спящего котика.</i>
    """,
    hug_away: """
    <i><%= who.fname <> " " <> who.sname %> хочет обнять котика, но его нет дома.</i>
    """,
    hug: """
    <i><%= who.fname <> " " <> who.sname %> обнимает <%= state %> котика.
    <%= cat.name %> <%= cat_action %>. Навскидку котейка весит </i><b> <%= cat.weight %> </b><i>кило и, кажется, <%= cat_dynamic %></i>
    """,
    mew: [
      "МЯУ!",
      "Мяу!",
      "Мяяяяу",
      "Мияу",
      "Меяу",
      "Ня",
      "Няяяяяя",
      "Няняияу"
    ],
    aggressive: [
      "ШШШшШшШ!!!",
      "ШшШшШшШшшшшш!",
      "МмшшшШШШШ!",
      "Шшшшшшшшшшшшш....",
    ],
    sleep: [
      "Хрррр-Хрррр",
      "Хр-Хр-Хр",
      "ХРРРРРРРРРР!",
      "Хрррхррвап...",
      "ХррХррр",
    ],
    stop: "<i>Котяра выпрыгнул с балкона и убежал.</i>",
    triggers: %{
      mew: ["ня", "мя", "мур"],
      cat: ["кис", "кот", "кош", "кыс"],
      dog: ["пес", "пёс", "соб", "щен", "барб"]
    }
  }

import_config "#{Mix.env}.exs"
import_config "secret.exs"
